{"data":{"site":{"siteMetadata":{"title":"Michael Blog","author":"Michael Luo"}},"markdownRemark":{"id":"14d6cae3-9f6a-54f5-8051-de35a5ef2b5b","excerpt":"JavaScript notes comparasion Plain JavaScript pros: Does not require any additional libraries or technology Offers the best performance Provides the best level…","html":"<h1>JavaScript notes</h1>\n<h2>comparasion</h2>\n<ul>\n<li>\n<p>Plain JavaScript</p>\n<ul>\n<li>pros:</li>\n<li>Does not require any additional libraries or technology</li>\n<li>Offers the best performance</li>\n<li>Provides the best level of compatibility with third-party libraries</li>\n<li>Allows the creation of ad hoc and more advanced algorithms</li>\n<li>cons:</li>\n<li>Might require extra code and relatively complex algorithms</li>\n</ul>\n</li>\n<li>\n<p>Async(lib)</p>\n<ul>\n<li>pros:</li>\n<li>Simplifies the most common control flow patterns</li>\n<li>Is still a callback-based solution</li>\n<li>Good performance</li>\n<li>cons:</li>\n<li>Introduce an extreanl dependency</li>\n<li>Might still not be enough for advanced flows</li>\n</ul>\n</li>\n<li>\n<p>Promises</p>\n<ul>\n<li>pros:</li>\n<li>Greatly simplifies the most common control flow patterns</li>\n<li>Robust error handling</li>\n<li>Part of the ES2015 specification</li>\n<li>Guarantees deferred invocation of onFulfilled and onRejected</li>\n<li>cons:</li>\n<li>Requires promisify callback-based APIs</li>\n<li>Intoduces a small performance hit</li>\n</ul>\n</li>\n<li>\n<p>Generators</p>\n<ul>\n<li>pros:</li>\n<li>Makes non-blocking API look like a blocking one</li>\n<li>Simplifies erro handling</li>\n<li>Part of ES2015 specification</li>\n<li>cons:</li>\n<li>Requires a complementary control flow library</li>\n<li>Still requires callbacks or promises to implement non-sequential flows</li>\n<li>Requires thunkify or promisify nongenerator-bnased APIs</li>\n</ul>\n</li>\n<li>\n<p>Async await</p>\n<ul>\n<li>pros:</li>\n<li>Makes non-blocking API look like blocking</li>\n<li>Clean and intuitive syntax</li>\n</ul>\n</li>\n</ul>\n<h2>Warning</h2>\n<p>With <code class=\"language-text\">let</code> and <code class=\"language-text\">const</code> in ES6, it’s no longer safe to check for an identifier’s existence using <code class=\"language-text\">typeof</code>:</p>\n<h2>Module</h2>\n<ul>\n<li>AMD: AMD stands for Asynchronous Module Definition. This system works in such a way that when the module is defined, usually at the moment of loading the file with the source code, it is not necessary when it is going to be used, but rather when it is available for later use in the system.</li>\n<li>CommonJS: Unlike AMD modules that are loaded asynchronously on demand, CommonJS modules are loaded synchronously</li>\n</ul>\n<h2>Pure function vs impure function</h2>\n<p><strong>Pure function</strong></p>\n<ul>\n<li>Must return something</li>\n<li>No matter how many times the function is executed the result should be the same if the input is also the same</li>\n<li>Input data must not be mutated during the execution of the function</li>\n<li>Not iterate over any array using for, while, do-while…</li>\n<li>Not sharing any state with other functions</li>\n<li>Implementing it should not have any side-effects in any other part of our program</li>\n</ul>\n<h2>JavaScript optimizing</h2>\n<ul>\n<li>\n<p>tail call optimization:The tail call optimization improvement is that if the return line is a function, it will not deal with call stack issues.</p>\n</li>\n<li>\n<p>Memoization: Memoization is the process of storing the results of expensive function calls and returning the cached result when the same inputs occur again.</p>\n</li>\n<li>\n<p>lazy loading: Consider an object that is expensive to create that is to say it takes a great deal of time to create the object. If we are unsure if the object’s value will be needed, we can defer its full creation until later.</p>\n</li>\n<li>\n<p>Currying – Partial application: Currying is the technique of translating the evaluation of a function that takes multiple arguments into evaluating a sequence of functions, each with a single argument.</p>\n</li>\n<li>\n<p>Composing: Composing is another benefit of functional programming allowing to generate super functions using existing functions.</p>\n</li>\n</ul>","frontmatter":{"title":"JavaScript Notes!","date":"January 31, 2019"}}},"pageContext":{"slug":"java-script-readme","previous":{"fields":{"slug":"dotnet-readme"},"frontmatter":{"title":"Dotnet Notes!"}},"next":{"fields":{"slug":"dev-ops-general"},"frontmatter":{"title":"General DevOps Notes!"}}}}