{"data":{"site":{"siteMetadata":{"title":"Michael Blog","author":"Michael Luo"}},"markdownRemark":{"id":"b702808b-e226-5a63-b68b-fb25f4c3e798","excerpt":"Angular Notes Angular is consisted of six parts: Data Binding Directive (There are three kinds of directives in Angular) Components — directives with a template…","html":"<h1>Angular Notes</h1>\n<p>Angular is consisted of six parts:</p>\n<ul>\n<li>Data Binding</li>\n<li>\n<p>Directive (There are three kinds of directives in Angular)</p>\n<ul>\n<li>Components — directives with a template.</li>\n<li>are the most common of the three directives</li>\n<li>Artribuite Directive</li>\n<li>change the appearance or behaviour of an element, component, or another directive.</li>\n<li>Structural Directive</li>\n<li>change the DOM layout by adding and removing DOM elements.</li>\n<li>i.e. iterator for components</li>\n</ul>\n</li>\n<li>\n<p>Forms</p>\n<ul>\n<li>Template-driven forms</li>\n<li>Reactive form</li>\n</ul>\n</li>\n<li>\n<p>Pipe</p>\n<ul>\n<li>Applying data tranformation</li>\n</ul>\n</li>\n<li>\n<p>Service</p>\n<ul>\n<li>Using Provider to apply Dependency Injection for service</li>\n</ul>\n</li>\n<li>\n<p>Module</p>\n<ul>\n<li>Root module</li>\n<li>Feature modules</li>\n</ul>\n</li>\n</ul>\n<h2>Design pattern</h2>\n<ul>\n<li>NgRx is using Observable pattern</li>\n<li>Unidirectional Data Flow ( this is no really two way data-binding in angular 2)</li>\n<li>Dependency intejection</li>\n</ul>\n<h2>Module</h2>\n<p><em>imports</em> This property is used to import the modules that are required by the classes in the modules.\n<em>providers</em> This property is used to define the module’s providers. When the feature module is\nloaded, the set of providers are combined with those in the root module, which means\nthat the feature module’s services are available throughout the application (and not just\nwithin the module).\n<em>declarations</em> This property is used to specify the directives, components, and pipes in the module.\nThis property must contain the classes that are used within the module and those that are\nexposed by the module to the rest of the application.\n<em>exports</em> This property is used to define the public exports from the module. It contains some or all\nof the directives, components, and pipes from the declarations property and some or all\nof the modules from the imports property.</p>\n<h2>RxJS</h2>\n<p><em>next(value)</em> This method creates a new event using the specified value.\n<em>error(errorObject)</em> This method reports an error, described using the argument, which can be any\nobject.\n<em>complete()</em> This method ends the sequence, indicating that no further events will be sent.</p>\n<h2>in-memory-web-api.</h2>\n<p>it is used to simulate HTTP requests using data that has been defined locally. This provides a way to isolate a data source\nclass and ensure that only its behavior is being tested</p>\n<h2>Test</h2>\n<p><em>Jasmine.JS</em> BDD test for Angular</p>\n<ul>\n<li>Define test component in testname.spec.ts</li>\n<li>Create test component</li>\n<li>describe test behaviour</li>\n</ul>\n<h2>Router bug</h2>\n<p><a href=\"https://stackoverflow.com/questions/38120756/angular2-router-navigate-refresh-page\">https://stackoverflow.com/questions/38120756/angular2-router-navigate-refresh-page</a></p>\n<p>Input type (type = “button) is important to make naviation animation works in angular 4, without specifying type, it works on IE11 and Edge browsers, but would reload the application in Chrome.</p>","frontmatter":{"title":"Angular Notes!","date":"July 21, 2019"}}},"pageContext":{"slug":"angular","previous":{"fields":{"slug":"api"},"frontmatter":{"title":"Notes for API engineering!"}},"next":{"fields":{"slug":"application"},"frontmatter":{"title":"Application Development Notes!"}}}}