{"data":{"site":{"siteMetadata":{"title":"Michael Blog","author":"Michael Luo"}},"markdownRemark":{"id":"65a67b80-e18f-52ee-ba96-4e6f7f9f3ff8","excerpt":"Methodology extreme programming scrum kanban Cargo Cult Being envious of the success and benefits of Agile, many companies adopt the superficial trappings of…","html":"<h2>Methodology</h2>\n<ul>\n<li>extreme programming</li>\n<li>scrum</li>\n<li>kanban</li>\n</ul>\n<h2>Cargo Cult</h2>\n<p>Being envious of the success and benefits of Agile, many companies adopt the superficial trappings of Agile, renaming the meetings as “stand ups” and calling management reviews “retrospectives”. But in practice, nothing changes. It’s still the same primitive management driven hierarchical organization, micromanaging the teams, using outdated waterfall practices, and completely failing to grasp the core principles of agility.</p>\n<h1>The Scrum team</h1>\n<ul>\n<li>\n<p>Product Owner (PO):collects requirements from customers (internal or external) and produces the requirements documents. The PO constantly aligns with customers and determines the scope of work and change in the scope, so the PO will get results from the Sprints. The PO is responsible for providing all the necessary product-related information required by the team and providing requirements.</p>\n</li>\n<li>\n<p>Scrum Master ( ScMa ) :is the servant-leader of the team who helps the team to deliver based on requirements. The ScMa organizes the process and moderates the meetings that will enable the team to deliver. Also, the ScMa provides statuses to the PO or any stakeholders. The ScMa is in charge of resolution of any block and impediments the team faces. The ScMa shelters and protects the team from external teams and stakeholders.</p>\n</li>\n<li>\n<p>The Architect (Arc)is the technical lead in the team</p>\n</li>\n<li>\n<p>The Quality Manager (QM) or Quality Engineer(QE) is the team member responsible for quality management of the product. The QM organizes the quality process in the team, educates the PO and ScMa on quality best practices, and provides quality requirements to the team based on feedback from the PO, industry standards, and best practices (Including performance, security, usability, accessibility etc.).</p>\n</li>\n<li>\n<p>Developers (DEV) estimate and commit to the estimation on a Sprint basis. They constantly improve the accuracy of the estimation and self-improve from Sprint to Sprint without micromanagement from other roles and managers. Developers distribute between the different expert roles—for example performance, security, and user interface designer.</p>\n</li>\n<li>\n<p>A Technical Writer (TW) writes supporting documentation for the project. This role can be centralized, since it is usually not required to have a full-time technical writer in the team. However, technical documentation also can be produced by any other role/roles in the team as an additional responsibility.</p>\n</li>\n</ul>","frontmatter":{"title":"Agile Notes!","date":"January 21, 2019"}}},"pageContext":{"slug":"/Agile/","previous":{"fields":{"slug":"/API/"},"frontmatter":{"title":"Notes for API engineering!"}},"next":{"fields":{"slug":"/Machine-Learning/training-algorithms/"},"frontmatter":{"title":"Training Algorithms of machine learning!"}}}}