{"data":{"site":{"siteMetadata":{"title":"Michael Blog","author":"Michael Luo"}},"markdownRemark":{"id":"1b808443-c793-54df-9fd3-10f9b0da3016","excerpt":"Unsupervised learning - Clustering Clustering (cluser analysis) is a technique that allows us to find groups of similar objects, objects that are more related…","html":"<h1>Unsupervised learning - Clustering</h1>\n<p>Clustering (cluser analysis) is a technique that allows us to find groups of similar objects, objects that are more related to each other than to objects in other groups.\nExaples of business-oriented applications of clustering include the grouping of documents, music, and moviews by different topics, or finding customers that share similar interests based on common purchase behaviors as a basis for recommendation egines.</p>\n<h2>k-means</h2>\n<p>It belongs to the cateory of protoype-based clustering.</p>\n<ul>\n<li>\n<p>Drawbacks</p>\n<ul>\n<li>One or more clusters can be empty</li>\n<li>we have to specify the number of clusters, k, a priori</li>\n</ul>\n</li>\n</ul>\n<h2>Hard VS Soft clustering</h2>\n<p>Hard clustering: a family of algorithms where each sample in a dataset is assigned to exactly on cluster.\nSoft clustering: sometimes called fuzzy clustering, it assign a sample to one or more clusters.</p>\n<ul>\n<li>fuzzy C-mean (FCM, also called soft k-means or fuzzy k-means).</li>\n</ul>\n<h2>hierachical</h2>\n<ul>\n<li>\n<p>agglomerative</p>\n<ul>\n<li>single linkage</li>\n<li>complete linkage</li>\n</ul>\n</li>\n<li>divisive clustering</li>\n</ul>\n<h2>density-based clustering</h2>\n<p>Density-based spatial Clustering of Applications with Noice (DBSCAN)</p>\n<p>Advantages:it does not assume that the clusters have a spherical shape as in k-means.</p>\n<p>Disadvantage: With an increasing number of features in our dataset -assuming a fixed number of training examples - the negative effect of curse of dimensionality increases.</p>","frontmatter":{"title":"Cluster Analysis Notes!","date":"January 31, 2019"}}},"pageContext":{"slug":"blog/machine-learning-clustering-analysis","previous":{"fields":{"slug":"blog/machine-learning-data-prepocessing"},"frontmatter":{"title":"Data Prepocessing Notes!"}},"next":{"fields":{"slug":"blog/machine-learning-embedding-model-to-webapp"},"frontmatter":{"title":"Embedding a machine learning model to web application Notes!"}}}}