{"data":{"site":{"siteMetadata":{"title":"Michael Blog","author":"Michael Luo"}},"markdownRemark":{"id":"b6038eaa-f369-5f44-abbd-d18da721d8a0","excerpt":"Dealling with umblanced dataset The conventional model evaluation methods do not accurately measure model performance when faced with imbalanced datasets…","html":"<h1>Dealling with umblanced dataset</h1>\n<p>The conventional model evaluation methods do not accurately measure model performance when faced with imbalanced datasets.</p>\n<h2>Collect more data</h2>\n<h2>Resampling</h2>\n<p>Standard classifier algorithms like Decision Tree and Logistic Regression have a bias towards classes which have number of instances. They tend to only predict the majority class data. The featueres of minority class are treated as noise and are often ignored. Thus, there is a high probability of misclassification of the nimority class as compared to the majority class.</p>\n<ul>\n<li>\n<p>Random under-sampling</p>\n<ul>\n<li>Advantages: It can help improve run time and storage problems by reducing the number of training data samples when the traing data set is huge.</li>\n<li>Disadvantages</li>\n<li>It can discard potentially useful information which could be important for building rule classifiers.</li>\n<li>The sample chosen by random under sampling may be a biased sample. And it will not be an accurate representative of the population. Thereby, resulting in inaccurate results with the actual test data set.</li>\n</ul>\n</li>\n<li>\n<p>Random over-sampling</p>\n<ul>\n<li>Advantages:</li>\n<li>No information loss</li>\n<li>Outerperforms under sampling</li>\n<li>Disadvantages</li>\n<li>It increases the likelihood of overfitting since it replicates the minority class events</li>\n</ul>\n</li>\n<li>\n<p>Cluster-based over sampleing</p>\n<ul>\n<li>Advantages</li>\n<li>This clustering technique helps overcome the challenge between class imbalance. Where the number of examples representing positive class differs from the number of examples representing a negative class.</li>\n<li>Overcome challenges within class imbalance, where a class is composed of different sub clusters. And each sub cluster does not contain the same number of examples</li>\n<li>disadvanteges</li>\n<li>The main drawback of this algorithm, like most oversampling techniques is the possibility of over-fitting the traning data.</li>\n</ul>\n</li>\n<li>\n<p>Informed over sampling: synthetic minority over-sampling technique</p>\n<ul>\n<li>Advantages</li>\n<li>Mitigates the problem of overfitting caused by random oversampling as synthetic examples are  generated rather than replication of instances</li>\n<li>No loss of useful infomation</li>\n<li>Disadvantages</li>\n<li>While generating sythetic examples SMOTE does not take into consideration neighboring examples from other classes. This can result in increase in overlapping of classes and can introduce additional noise</li>\n<li>SMOTE is not very effective for high dimensional data</li>\n</ul>\n</li>\n<li>Modified synthetic minority oversampling technique (MSMOTE)</li>\n</ul>\n<h2>Ensemble techniques</h2>","frontmatter":{"title":"Dealling with umblanced dataset Notes!","date":"January 31, 2019"}}},"pageContext":{"slug":"machine-learning-dealling-with-umblanced-dataset","previous":{"fields":{"slug":"machine-learning-data-prepocessing"},"frontmatter":{"title":"Data Prepocessing Notes!"}},"next":{"fields":{"slug":"java-script-readme"},"frontmatter":{"title":"JavaScript Notes!"}}}}