{"data":{"site":{"siteMetadata":{"title":"Michael Blog","author":"Michael Luo"}},"markdownRemark":{"id":"532fe1ea-5287-5d68-b0ef-9352a127446e","excerpt":"Behavioral Pattern Strategy pattern \nIn Strategy pattern, a class behavior or its algorithm can be changed at run time. This type of design pattern comes under…","html":"<h2>Behavioral Pattern</h2>\n<p><strong>Strategy pattern</strong>\nIn Strategy pattern, a class behavior or its algorithm can be changed at run time. This type of design pattern comes under behavior pattern.</p>\n<p>In Strategy pattern, we create objects which represent various strategies and a context object whose behavior varies as per its strategy object. The strategy object changes the executing algorithm of the context object.</p>\n<p><strong>Command pattern</strong>\nCommand pattern is a data driven design pattern and falls under behavioral pattern category. A request is wrapped under an object as command and passed to invoker object. Invoker object looks for the appropriate object which can handle this command and passes the command to the corresponding object which executes the command.</p>\n<p><strong>Observer pattern</strong>\nObserver pattern is used when there is one-to-many relationship between objects such as if one object is modified, its depenedent objects are to be notified automatically. Observer pattern falls under behavioral pattern category.</p>\n<h2>Structural Pattern</h2>\n<p><strong>Adapter pattern</strong>\nAdapter pattern works as a bridge between two incompatible interfaces. This pattern involves a single class which is responsible to join functionalities of independent or incompatible interfaces.</p>\n<p><strong>Decorator pattern</strong>\nDecorator pattern allows a user to add new functionality to an existing object without altering its structure. This type of design pattern comes under structural pattern as this pattern acts as a wrapper to existing class.</p>\n<p>This pattern creates a decorator class which wraps the original class and provides additional functionality keeping class methods signature intact.</p>","frontmatter":{"title":"Design Pattern Notes!","date":"January 31, 2019"}}},"pageContext":{"slug":"design-pattern","previous":{"fields":{"slug":"dev-ops-aws"},"frontmatter":{"title":"AWS Notes!"}},"next":{"fields":{"slug":"database-compare"},"frontmatter":{"title":"Datebase Notes!"}}}}