{"data":{"site":{"siteMetadata":{"title":"Michael Blog","author":"Michael Luo"}},"markdownRemark":{"id":"f37f9248-796d-5fb1-8fb9-bb9690c79b3f","excerpt":"Data-intensive architecute A data-intensive application Many applications today are data-intensive, as opposed to compute-intensive. Raw CPU power is rarely a…","html":"<h1>Data-intensive architecute</h1>\n<h2>A data-intensive application</h2>\n<p>Many applications today are data-intensive, as opposed to compute-intensive. Raw CPU power is rarely a limiting factor for these applications—bigger problems are usually the amount of data, the complexity of data, and the speed at which it is changing.</p>\n<p>A data-intensive application is typically built from standard building blocks that provide commonly needed functionality. For example, many applications need to:</p>\n<ul>\n<li>\n<p>Store data so that they, or another application, can find it again later (databases)</p>\n</li>\n<li>\n<p>Remember the result of an expensive operation, to speed up reads (caches)</p>\n</li>\n<li>\n<p>Allow users to search data by keyword or filter it in various ways (search indexes)</p>\n</li>\n<li>\n<p>Send a message to another process, to be handled asynchronously (stream processing)</p>\n</li>\n<li>\n<p>Periodically crunch a large amount of accumulated data (batch processing)</p>\n</li>\n</ul>\n<h2>three concerns that are important in most software systems:</h2>\n<p><code class=\"language-text\">Reliability</code>\nThe system should continue to work correctly (performing the correct function at the desired level of performance) even in the face of adversity (hardware or software faults, and even human error). See “Reliability”.</p>\n<p><code class=\"language-text\">Scalability</code>\nAs the system grows (in data volume, traffic volume, or complexity), there should be reasonable ways of dealing with that growth. See “Scalability”.</p>\n<p><code class=\"language-text\">Maintainability</code>\nOver time, many different people will work on the system (engineering and operations, both maintaining current behavior and adapting the system to new use cases), and they should all be able to work on it productively. See “Maintainability”.</p>\n<h2>Lagacy system</h2>\n<p>Many people working on software systems dislike maintenance of so-called legacy systems—perhaps it involves fixing other people’s mistakes, or working with platforms that are now outdated, or systems that were forced to do things they were never intended for</p>","frontmatter":{"title":"Data-intensive Architecture Notes!","date":"January 21, 2019"}}},"pageContext":{"slug":"architecture-data-itensive","previous":{"fields":{"slug":"application"},"frontmatter":{"title":"Application Development Notes!"}},"next":{"fields":{"slug":"agile"},"frontmatter":{"title":"Agile Notes!"}}}}