{"data":{"site":{"siteMetadata":{"title":"Michael Blog","author":"Michael Luo"}},"markdownRemark":{"id":"441f11f8-dc2e-5095-ba44-c5a2986a5fb2","excerpt":"Notes for NodeJS NodeJS drawback Due to it uses sigle tread, it results in bad performance on CPU intensive computing (concurrent computing or grid computing…","html":"<h1>Notes for NodeJS</h1>\n<h2>NodeJS drawback</h2>\n<p>Due to it uses sigle tread, it results in bad performance on CPU intensive computing (concurrent computing or grid computing)</p>\n<h2>Asynchronous batching and caching</h2>\n<p><strong>Batching</strong>\nIf we are invoking an asynchronous function while there is still another one pending, we can attach callback to the already running operation, instead of creating a brand new request.</p>\n<p>Problems:\nThe faster the API, the fewer batched requests we get. Alought the API is fast enough, it still represents a factor in the resource load of an application.\nAlso, sometimes we can safely assume that the result of an API invocation will not change so often; therefore, a simple request batching willl not provide the best performance. In all these circumstances, the best candidate to reduce the load of an application and increase its responsiveness is definitely a more agressive caching pattern.</p>\n<p><strong>Catching</strong>\nAs soon as a request completes, we store its result in the catch, which can be a variable, an entry in the database, or in a specialized catching server. Hence, the next time the API is invoked, the result can be retrieved immediately from the cache, insead of spawning another request.</p>\n<h2>Running CPU-bound tasks</h2>\n<h2>Scalability</h2>\n<ul>\n<li>Three dimesions\nx-axis: Cloning\ny-axis: Decomposing by service/functionality\nz-axis: Splitting by data partition</li>\n</ul>\n<p>vertical scaling - adding more resources to a single machine\nhorizontal scaling - adding more machines to the infrastructure</p>\n<ul>\n<li>Cloning</li>\n</ul>","frontmatter":{"title":"NodeJS Notes!","date":"February 03, 2019"}}},"pageContext":{"slug":"node-js-readme","previous":{"fields":{"slug":"node-js-architecture"},"frontmatter":{"title":"NodeJS Architecture Pattern!"}},"next":{"fields":{"slug":"node-js-cookbook"},"frontmatter":{"title":"NodeJS Cookbook!"}}}}